# Exploration of NY Police Salaries 2016 - 2019
Notebook Author: Mitchell Jones 

This notebook is intended as a exploration of various statistics and comparisons surrounding NY Police Officer & Police Department salaries from the years 2016 - 2019. Given recent events and discourse on social media platforms like Twitter, I found it pertinent to explore these statistics with the aim of answering various questions, including:

How are police paid differently from other city employees?
What departments of the city are paid the most?
Do Police Officers receive Overtime Pay at higher rates, or percentages? What about Police Department Employees?

Source Data can be found at: https://data.cityofnewyork.us/City-Government/Citywide-Payroll-Data-Fiscal-Year-/k397-673e

# Import Statements

In [17]:
# Import Statements - Data Handling
import os
import pandas as pd
# Visualization
import matplotlib as plt
import seaborn as sns

In [18]:
# Set working directory
os.chdir('/Users/user1/Downloads')
# Import File
filename = 'Citywide_Payroll_Data__Fiscal_Year_.csv'
payroll = pd.read_csv(filename)

# Basic Exploration

In [19]:
# Display Initial Statistics - Check Head of Data
payroll.head()

,Fiscal Year,Payroll Number,Agency Name,Last Name,First Name,Mid Init,Agency Start Date,Work Location Borough,Title Description,Leave Status as of June 30,Base Salary,Pay Basis,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay
0,2016,NaN,DISTRICT ATTORNEY-MANHATTAN,ABA'AHMID,RAHASHEEM,E,07/14/2003,MANHATTAN,COMMUNITY ASSOCIATE,ACTIVE,47678.0,per Annum,1830.00,47166.03,2.25,57.28,0.0
1,2016,NaN,DISTRICT ATTORNEY-MANHATTAN,ABENSUR,MARGARET,NaN,06/12/1995,MANHATTAN,ADMINISTRATIVE ACCOUNTANT,ACTIVE,119959.0,per Annum,1831.00,119042.50,0.00,0.00,0.0
2,2016,NaN,DISTRICT ATTORNEY-MANHATTAN,ABOUNAOUM,ANDREA,L,10/11/2011,MANHATTAN,COMMUNITY ASSOCIATE,ON LEAVE,39966.0,per Annum,1181.68,27452.62,1.00,21.34,33.0
3,2016,NaN,DISTRICT ATTORNEY-MANHATTAN,ABRAHAM,JONATHAN,J,12/01/2014,MANHATTAN,COMPUTER SYSTEMS MANAGER,ACTIVE,116000.0,per Annum,1831.00,115104.57,0.00,0.00,0.0
4,2016,NaN,DISTRICT ATTORNEY-MANHATTAN,ABRAMS,JOSEPH,NaN,05/21/2015,MANHATTAN,COLLEGE AIDE,CEASED,1.0,per Hour,0.00,3500.00,0.00,0.00,0.0

In [20]:
# Check DataTypes
payroll.dtypes

Fiscal Year                     int64
Payroll Number                float64
Agency Name                    object
Last Name                      object
First Name                     object
Mid Init                       object
Agency Start Date              object
Work Location Borough          object
Title Description              object
Leave Status as of June 30     object
Base Salary                   float64
Pay Basis                      object
Regular Hours                 float64
Regular Gross Paid            float64
OT Hours                      float64
Total OT Paid                 float64
Total Other Pay               float64
dtype: object

In [21]:
# Describe Numeric Columns
payroll.describe()

,Fiscal Year,Payroll Number,Base Salary,Regular Hours,Regular Gross Paid,OT Hours,Total OT Paid,Total Other Pay
count,3.333080e+06,1.587640e+06,3.333080e+06,3.333080e+06,3.333080e+06,3.333080e+06,3.333080e+06,3.333080e+06
mean,2.016551e+03,5.788984e+02,4.245116e+04,6.685378e+02,4.173166e+04,5.872698e+01,3.255362e+03,2.094629e+03
std,1.704581e+00,2.980495e+02,4.089202e+04,8.855774e+02,3.869131e+04,1.463332e+02,8.867136e+03,5.057170e+03
min,2.014000e+03,2.000000e+00,1.000000e-02,-7.304300e+02,-7.622305e+04,-2.090000e+02,-2.649388e+04,-2.815950e+05
25%,2.015000e+03,3.000000e+02,3.318000e+01,0.000000e+00,3.908155e+03,0.000000e+00,0.000000e+00,0.000000e+00
50%,2.017000e+03,7.420000e+02,4.107900e+04,0.000000e+00,3.582054e+04,0.000000e+00,0.000000e+00,0.000000e+00
75%,2.018000e+03,7.470000e+02,7.648800e+04,1.825000e+03,7.320607e+04,1.750000e+00,1.893225e+02,1.105633e+03
max,2.019000e+03,9.960000e+02,3.527630e+05,4.171430e+03,6.723089e+05,3.347500e+03,2.373897e+05,1.003558e+05

In [22]:
# Lets convert Fiscal Year and Agency Start Date to datetime objects later
# Check Number of Unique Values Per Column
payroll.nunique()

Fiscal Year                         6
Payroll Number                    157
Agency Name                       165
Last Name                      151345
First Name                      84267
Mid Init                           43
Agency Start Date               14621
Work Location Borough              22
Title Description                1761
Leave Status as of June 30          5
Base Salary                     89793
Pay Basis                           4
Regular Hours                   80637
Regular Gross Paid            1613980
OT Hours                        47944
Total OT Paid                  706450
Total Other Pay                659237
dtype: int64

In [23]:
# Odd - there are 6 unique values of Fiscal Year; We will investigate that further.
# Number of Nulls per Column
payroll.isnull().sum()

Fiscal Year                         0
Payroll Number                1745440
Agency Name                         0
Last Name                        1677
First Name                       1698
Mid Init                      1355564
Agency Start Date                   0
Work Location Borough          506223
Title Description                  78
Leave Status as of June 30          0
Base Salary                         0
Pay Basis                           0
Regular Hours                       0
Regular Gross Paid                  0
OT Hours                            0
Total OT Paid                       0
Total Other Pay                     0
dtype: int64

In [24]:
# Columns to Investigate NaN's in:
# Payroll Number, First / Last Name / Middle Initial, Work Location, Title Description

# Data Preparation
To-Do List:
<br>Convert Fiscal Year / Agency Start Date to Dt Objects
<br>Investigate Unique Values of Fiscal Year
<br>Address NaNs